{"Public/Sessions/Mechanics-and-Rulings":{"title":"Mechanics and Rulings","links":["Miridan","_Weave-Stone"],"tags":[],"content":"New Mechanics\nA main goal of this campaign for me is to keep DND as dynamic and creative as possible, so we will be experimenting with new mechanics to make the entire campaign as fun as possible.\n\n\nNew Spells and Abilities\n\nThe spells and abilities in the Player Handbook are not the end of magic and skill. The spells, class features, and even classes in the Player Handbook simply represent what is common knowledge at the start of the campaign. Those who specialize in their arts are sure to have discovered more.\nWhen a spell or ability is used that a player does not recognize, the players who saw the effect can roll an Intelligence Check or Wisdom Check, depending on the situation, to learn how it works.\nSpells and abilities that the party learn about will be posted in the World section of this document afterwards for ease of access.\n\n\n\nCreating New Spells and Abilities\n\nCharacters can spend time practicing with their bow or pouring over old runes to learn new skills or invent new spells.\nTo start creating a new spell or ability tell me what your character is trying to create. Then your character must spend a total of 24 hours working on the new skill or ability. This time does not and should not be consecutive. For example a character might put in three hours of practice before getting ready to rest for the night. At the end of the 24 hours the player rolls an appropriate skill check and I will provide you with the details of what your character has created.\nBased on the roll and what your character could plausibly achieve the new spell or ability may do some, all, or none of what you intended. If your character is not happy with the result,  they can continue work on the spell or ability for another 24 hours and roll again.\nI want to add some creation process for the players characters can truly be unique. That being said I am not in the business of trying to balance all these spells so please don’t try to metagame with this. For example, if you try to create a spell similar to power word kill as a level 7 character you will fail.\n\n\n\nAltered Mechanics\nTo better fit the magical systems of Miridan some aspects of the beloved Player Handbook need to be altered. Rules below take president over the Player Handbook, if something is not mentioned, default to the Player Handbook.\n\n\nAbility Checks and Saving Throws\n\nSome Ability Checks and Saving Throws can have an extra two tiers of performance based on the table below.\n\nFull Success occurs when the creature rolls above or equal to the DC+2.\nHalf Success occurs when the creature rolls above or equal to DC.\nHalf Failure occurs when the creature rolls above or equal to DC−2.\nFull Failure occurs when the creature rolls below all the others.\n\n\nThe goal for this is to make some spells and abilities, new or old, feel less bad if the effect does not land. For these spells its harder to get a full success, but its also harder to completely waste your turn and spell slot.\n\n\n\nArcane Signets\n\nArcane Signets can only exist as a spell casters Weave Stones which has been specially crafted to allow for the creation of components. Spell casters Weave Stones will contain a field Arcane Signet Level which determines the maximum spell level that it can create physical components for.\n\n\n"},"Public/Sessions/Session-One":{"title":"Session One","links":["Public/Sessions/Mechanics-and-Rulings"],"tags":[],"content":"Pre Session Information\n\nGeneral Information\n\nCheck out Mechanics and Rulings for new rules and changed rules. Any rule listed there overrides the Player Handbook or other sources.\nBefore Session One I need to meet with each player to flush out backstory, discuss character goals, and properly tie them into Miridan. Players who have not met with me:\n\n Sara\n Josiah\n Landon\n Damion\n Renee\n\n\n\n\nCharacter Creation Information\n\nCharacters will be starting at level 6.\nI want to add a little more roleplaying into this campaign so create a character you actually like and would want to play as.\nThis campaign will not be taking place in Faerun, descriptions of the world of Faerun and or its people may or may not be accurate. I am mostly using the 5e system to for mechanics but mostly ignoring it in world building.\nAnything in the 5e handbook, Xanathar’s, and Tasha’s Cauldron is legal.\nPick non magical races for your characters (non magical is considered a race that might plausibly exist on Earth. For example elves could plausibly fit into the current physics system but dragon born might not as they require the existence of dragons).\n\n\nCharacter Backstory Creation\n\nPlease put effort into your characters backstory. I want to tie backstory into events, plot lines, allies, enemies, or resources.\nPlease also add reason that your character might currently be in a prison.\nMake sure your backstory is consistent with some general information about the world:\n\nThe Common Races are the non magical races (which you are playing as). Though magic existed all around them, they were never able use it themselves. Until 10 years ago. 10 years ago a new material was discovered, Oculite, which could reshape the weave around itself. Weave Stones were quickly created and granted the Common Races artificial magical abilities. These extraordinary abilities gave rise to the classes of DND that we now know and love.\nMost of Miridan is not explored or mapped by the Common Races. The Rangers Guild is an organization within the Kingdom of Kalos dedicated to exploration, but venturing into the massive Virulent Forest that surrounds Kalos is dangerous and few parties have made it to the other side and back again.\nKalos is the only major kingdom and safe haven for the Common Races. Its invests much of its resources into maintain the great walls that protect its citizens from the known and unknown predators in the Virulent Forest. Outpost settlements do exist, but are generally considered very dangerous to live in without extreme forms of protection.\n\n\n\n\n"},"index":{"title":"Veins Of Miridan","links":["Public/Sessions/Mechanics-and-Rulings","Kalos","Miridan","NPCs","Locations","Lore","Items","Spells","Abilities","Public/Sessions/Session-One"],"tags":[],"content":"Welcome to the Veins of Miridan homepage! This document will act as a lore document, session history, item catalog, and creature catalog. Check below before each session for pre-session information and or announcements.\nThis campaign does not take place in Faerun, so descriptions, locations, and mechanics may vary. See Mechanics and Rulings for mechanics information and the sections below for world information.\nWorld information as your characters know it and as is generally known in Kalos is accessible via the links below. However, just because something is written does not mean it is fact, it is simply the best knowledge your character currently has. As you explore Miridan links and notes will update with the information you find.\n\nNPCs\nLocations\nLore\nItems\nSpells\nAbilities\n\nSession Information\nTransclude of Session-One"}}